[
  {
    "path": "posts/welcome/",
    "title": "Welcome to ISSS608 - Visual Analytics Project Blog",
    "description": "Welcome to our new blog, ISSS608 - Visual Analytics Project Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-02-27",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-27T22:22:33+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-02-27-visual-analytics-project-proposal-group-9/",
    "title": "Enabling optimization of Bike Sharing Operations – Bluebikes",
    "description": "Project Proposal for ISSS608 Visual Analytics Project - Group 9",
    "author": [
      {
        "name": "Liu Jie, Wang Ziqi, Vikram Shashank Dandekar",
        "url": {}
      }
    ],
    "date": "2021-02-27",
    "categories": [],
    "contents": "\r\nBackground & Motivation\r\nThe advent of shared bikes has provided people with a new way of commuting, and has picked up rapidly due to its convenience and low cost. However, there are still some problems at the current stage, such as an over-accumulation of bikes at certain areas leading to inconveniences to the public. On the flip side, there could be insufficient supply of bikes at selected stations during peak periods leading to potential users choosing an alternate form of transport. There is also the issue of overused bikes lacking maintenance/servicing at the right time intervals.\r\nBluebikes currently has a mobile app for users to locate stations and pay the fees to complete the rental process with a few clicks. However, there is currently no platform that provides an integrated analytics capability to perform exploratory analysis of the trip data and gather insights to improve the operations. This is the gap that our team is intrigued to close. We would like to design an interactive application that will help the executives of Blue Bikes to analyze and visualize users’ trip data. This application would serve as the go-to analytics platform for gathering insights on the bike sharing operations and facilitate decision making on improvement ideas.\r\nObjectives\r\nThe objective of this project is to create an app using R-Shiny that will enable Bluebikes to focus on the operational optimization of their bike fleet supply at each of the stations via:\r\nExploratory and Confirmatory interface to analyze bike trip duration and intensity of bike station activity\r\nAnalyze the deficit or excess of bikes that are moving in and out of the numerous bike stations\r\nOptimize the utilization rate of their entire bike fleet\r\nTrack and determine the right time to perform servicing and maintenance on the bike fleet\r\nData Source & Description\r\nThe data source for this project will be taken from Kaggle. This is the Bluebikes Trip Data for the month of Jan-2020.\r\nLink: https://www.kaggle.com/rgt6899/bluebike-usage-promotion-project\r\nThe metadata and list of GPS co-ordinates and number of docks for each bike station is provided in the link below. It also contains other key data that will be used as reference for the project.\r\nLink: https://www.bluebikes.com/system-data\r\nData Preparation\r\nSplit “starttime” and “stoptime” into date and time format.\r\nDerive age by using 2020 minus “birth year” and create age groups.\r\nMerge the data file “202101-bluebikes-tripdata” and “current_bluebikes_stations” which contains the number of docks of each station.\r\nCalculate the inbound of a station minus the outbound of a station during a time period. If the result is positive, the station has an excess. If it is negative, the station is in deficit.\r\nCalculate the utilization of bikes by using the unique bike id divide the total number of bikes which we will take the number of bikes in the starting of 2020.\r\nApplication Features\r\nMODULE 1 - Proportional Symbol Map to show the popularity of stations\r\n\r\nInteractive Features:\r\nFilter/slider for time of day\r\nSelector for age group\r\nSelector for gender\r\nCustomer vs. subscriber selector\r\nMODULE 2 - Analysis of defict/excess of bikes\r\n\r\nInteractive Features:\r\nTime period selector/Day of month\r\nStation Name selector\r\nMODULE 3 - Analysis of Bike Fleet Utilization\r\n\r\nInteractive Features:\r\nFilter for time of day.\r\nMODULE 4 - Bike Servicing Analyzer\r\n\r\nInteractive Features:\r\nBike ID selector\r\nBoxplot to customize selection of data points.\r\nR Packages to be Utilized\r\nName\r\nPurpose\r\nggplot2\r\nTo create the relevant graphical plots.\r\ndplyr\r\nTo manipulate the raw data to suit the needs of the project.\r\nreadr\r\nTo read in raw data in csv format.\r\nleaflet\r\nFor building Interactive Maps.\r\nRgoogleMaps\r\nTo query Google server for Static maps & to use map as background image to overlay plots.\r\nggmap\r\nvisualize spatial data and models on top of static maps.\r\nmapproj\r\nConverts latitude/longitude into projected coordinates.\r\nsf (Simple features)\r\nTo standardize encoding of spatial vector data.\r\nOpenStreetMap\r\nFor access to high resolution raster maps.\r\ndevtools\r\nTo make package development easier by providing R functions that simplify and expedite common tasks.\r\nDT (DataTables)\r\nProvides filtering, pagination, sorting, and many other features.\r\nColourpicker\r\nTo use the colorInput() and plotHelper() functions\r\nggforce\r\nTo provide a repository of geoms, stats etc.\r\nPlotly\r\nCreating interactive web-based graphs\r\nLattice\r\nTo display multivariate relationships and support creation of trellis graphs.\r\nPatchwork\r\nTo combine separate ggplots into the same graphic.\r\nGithub Repository\r\nThe project has been initiated on Github. Here is the link: https://github.com/vikramchamp/VA-Project-Blog\r\nReferences\r\nBluebikes main page - https://www.bluebikes.com/\r\nBluebikes System Data - https://www.bluebikes.com/system-data\r\nBluebikes Complete Data Set for Jan 2020 - https://www.kaggle.com/rgt6899/bluebike-usage-promotion-project\r\nInformation on R packages - https://cran.r-project.org/web/packages\r\nTop 10 R Packages for Data Visualization - https://analyticsindiamag.com/top-10-r-packages-for-data-visualisation/\r\nhttps://www.bicyclehabitat.com/how-to/a-simple-bike-maintenance-chart-pg366.htm\r\nhttps://www.trekbicyclestoregreensboro.com/tips/recommended-maintenance-chart-pg117.htm\r\nhttps://bicycleuniverse.com/how-long-to-bike-mile/#\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-28T19:13:21+08:00",
    "input_file": "visual-analytics-project-proposal-group-9.utf8.md"
  }
]
